In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy.stats as stats
import seaborn as sns
from pydataset import data
from env import get_db_url
# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
# import our own acquire module
import acquire

# Classification
* Supervised machine learning
* Is this new observation A or B (or C, D, or E)?
* Categorical

- `Classifier`:
    - Binary = 2 outcomes = pass/fail
    - Multi-class = 2+ classes = school grade levels (1st-12th)
- `Algorithm` vs `Model`: General vs Specific
- `Feature`: A feature, aka input/independent variable, is an individual measurable property of a phenom being observed
- `Database` vs `Dataset`: DB has datasets

#### sklearn classification models
- Logistic Regression (sklearn.linear_model.LogisticRegression)
    - Predict binary outcome
- Decision Tree (sklearn.tree.DecisionTreeClassifier)
    - tree splitting data based on rules
- K-Nearest Neighbors (sklearn.neighbors.KNeighborsClassifier)
    - looks at plotted neighbors to id data
- Random Forest (sklearn.ensemble.RandomForestClassifier)
    - decision trees within a decision tree and goes with majority

## Data Acquisition

CSV
- `pd.read_csv(`url`)`
    - url = google_sheets`.replace(`'/edit#gid=', '/export?format=csv&gid='`)`

Clipboard (table in text)
- `pd.read_clipboard()`

MS Excel
- `pd.read_excel(`url`)`

SQL
- `pd.read_sql(`sql_query,sql_url`)`

Caching Data
- df`.to_csv(`new_filename.csv`)`

In [2]:
# import os

# def get_titanic_data():
#     filename = "titanic.csv"

#     if os.path.isfile(filename):
#         return pd.read_csv(filename)
#     else:
#         # read the SQL query into a dataframe
#         df = pd.read_sql('SELECT * FROM passengers', get_connection('telco_db'))

#         # Write that dataframe to disk for later. Called "caching" the data for later.
#         df.to_file(filename)

#         # Return the dataframe to the calling code
#         return df

### Exercises

Use a python module (pydata or seaborn datasets) containing datasets as a source for the iris data. Create a pandas dataframe, `df_iris`, from this data

In [3]:
df_iris = data('iris')

In [4]:
# print the first 3 rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [5]:
# print the number of rows and columns (shape)
df_iris.shape

(150, 5)

In [6]:
# print the column names
df_iris.columns.to_list()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [7]:
# print the data type of each column
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [8]:
# print the summary statistics for each of the numeric variables
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Read the data from this google sheet into a dataframe, `df_google`.

In [9]:
gsh = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit?usp=sharing'
url = gsh.replace('/edit?', '/export?format=csv&')
df_google = pd.read_csv(url)

In [10]:
# print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [11]:
# print the number of rows and columns
df_google.shape

(891, 12)

In [12]:
# print the column names
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
# print the data type of each column
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
# print the summary statistics for each of the numeric variables
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
# print the unique values for each of your categorical variables
for i in ['Survived', 'Pclass', 'Sex', 'SibSp','Parch', 'Embarked']:
    print(df_google[i].unique())

[0 1]
[3 1 2]
['male' 'female']
[1 0 3 4 2 5 8]
[0 1 2 5 3 4 6]
['S' 'C' 'Q' nan]

Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named `df_excel`.

In [16]:
df_excel = pd.read_excel('train.xlsx', sheet_name='train')

In [17]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = df_excel.head(100)

In [18]:
# print the number of rows of your original dataframe
df_excel.shape[0]

891

In [19]:
# print the first 5 column names
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [20]:
# print the column names that have a data type of object
df_excel.select_dtypes(include='object').columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [21]:
# compute the range for each of the numeric variables.
for i in ['Age','Fare']:
    print(i, df_excel[i].max() - df_excel[i].min())

Age 79.58
Fare 512.3292

Make a new python module, acquire.py to hold the following data acquisition functions:

- Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [22]:
import os

In [23]:
def titanic_data():
    """
    This function checks if a CSV file exists, reads it if it does, and if not, reads data from a SQL
    database, saves it to a CSV file, and returns the data.
    :return: The function `get_titanic_data()` returns a pandas DataFrame containing the Titanic
    passenger data. If the data has been previously cached as a CSV file, it reads the data from the
    file. Otherwise, it reads the data from a SQL database, caches it as a CSV file, and returns the
    DataFrame.
    """
    filename = "titanic.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('select * from passengers', get_db_url('titanic_db'))
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)
        # Return the dataframe to the calling code
        return df

- Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [24]:
def iris_data():
    """
    This function checks if a CSV file exists, and if it does, it returns the data from the file,
    otherwise it reads data from a SQL database, saves it to a CSV file, and returns the data.
    :return: The function `get_iris_data()` returns a pandas DataFrame containing the iris data. If the
    data is already cached in a CSV file named "iris.csv", it reads the data from the file. Otherwise,
    it reads the data from a SQL database named "iris_db", joins the "species" and "measurements"
    tables, caches the data in a CSV file, and returns the DataFrame.
    """
    filename = "iris.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('select * from species join measurements using (species_id)', get_db_url('iris_db'))
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)
        # Return the dataframe to the calling code
        return df

- Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [25]:
def telco_data():
    """
    This function reads telco data from a CSV file if it exists, otherwise it reads the data from a SQL
    database and saves it to the CSV file for future use.
    :return: The function `get_telco_data()` returns a pandas DataFrame containing data from either a
    CSV file named "telco.csv" or a SQL query from a database named "telco_churn". If the CSV file
    exists, it reads the data from the file, otherwise it reads the data from the SQL query, saves it to
    the CSV file for caching, and returns the DataFrame.
    """
    filename = "telco.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('select * from customers join contract_types using(contract_type_id) join internet_service_types using(internet_service_type_id) join payment_types using(payment_type_id)', get_db_url('telco_churn'))
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename, index=False)
        # Return the dataframe to the calling code
        return df

- Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [26]:
import acquire

## Data Preparation

Summarize data:
- `head()`, `describe()`, `info()`, `isnull()`, `value_counts()`, `shape`, ...
- looking at one var at a time
- know what the columns mean/represent
- know what the rows mean/represent
    - 1 unique obs per row
- visualize
    - `plt.hist()`, `plt.boxplot()`
- document takeaways (nulls, dtypes to change, outliers, ideas for features, etc.)

Clean data:
- `nulls/missing values`: drop columns/rows with too many missing values, fill with 0 (or mode/max/min), take note of applicable columns/rows
    - `.isnull()`
    - `.value_counts(dropna=False)`
    - `.fillna(value=`''`)`
    - df = df`.drop(columns=`''`)`
- `outlier`: obs distant from other observations
    - ignore, drop rows, snap to selected max/min, create bins (cut, qcut)
- `create new` variables (z = x - y)
- `rename` columns
- `encoding/data-types`: need numeric data for model (dummy vars, factor vars, manual coding)
    - `pd.get_dummies(`df.col, `drop_first=`True`)`

Split data:
- `split` to train, validate, test sample dataframes
    - from sklearn.model_selection import train_test_split
    - `train_test_split(`df, `random_state=`123, `test_size=`.2, `stratify=`target_var`)`
- `train`: in-sample, explore, impute mean, scale numeric data (max-min...), fit ml algorithms, test models
- `validate`: confirm top models don't overfit, test on unseen data
    - validate performance, pick best model
- `test`: out-of-sample, expected model performance on unseen data
    - only used on 1 model

Impute Missing Values
- from sklearn.impute import SimpleImputer
- split then impute to keep unseen data true
- imputer = `SimpleImputer(missing_values =` None, `strategy=`'most_frequent'`)`
- imputer = `imputer.fit(`col`)`
- train[col] = `imputer.transform(`train[col]`)`
    - same for validate and test
- impute or fillna

### Exercises

Using the Iris Data:

- Use the function defined in `acquire.py` to load the iris data.

In [27]:
iris = acquire.get_iris_data()
iris.sample(5)

csv file found and loaded

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
30,1,setosa,31,4.8,3.1,1.6,0.2
143,3,virginica,144,6.8,3.2,5.9,2.3
138,3,virginica,139,6.0,3.0,4.8,1.8
123,3,virginica,124,6.3,2.7,4.9,1.8
24,1,setosa,25,4.8,3.4,1.9,0.2

- Drop the `species_id` and `measurement_id` columns.

In [28]:
iris = iris.drop(columns=['species_id','measurement_id'])
iris.sample(5)

   species_name  sepal_length  sepal_width  petal_length  petal_width
29       setosa           4.7          3.2           1.6          0.2
49       setosa           5.0          3.3           1.4          0.2
17       setosa           5.1          3.5           1.4          0.3
24       setosa           4.8          3.4           1.9          0.2
23       setosa           5.1          3.3           1.7          0.5

- Rename the `species_name` column to just `species`.

In [29]:
iris = iris.rename(columns={'species_name':'species'})
iris.sample(5)

        species  sepal_length  sepal_width  petal_length  petal_width
100   virginica           6.3          3.3           6.0          2.5
94   versicolor           5.6          2.7           4.2          1.3
122   virginica           7.7          2.8           6.7          2.0
149   virginica           5.9          3.0           5.1          1.8
2        setosa           4.7          3.2           1.3          0.2

- Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [30]:
dummy_iris = pd.get_dummies(iris.species, drop_first=True)
dummy_iris.sample(5)

     versicolor  virginica
105           0          1
88            1          0
134           0          1
5             0          0
54            1          0

In [31]:
iris = pd.concat([iris, dummy_iris], axis=1)
iris.sample(5)

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
13,setosa,4.3,3.0,1.1,0.1,0,0
18,setosa,5.7,3.8,1.7,0.3,0,0
93,versicolor,5.0,2.3,3.3,1.0,1,0
110,virginica,6.5,3.2,5.1,2.0,0,1
63,versicolor,6.1,2.9,4.7,1.4,1,0

- Create a function named `prep_iris` that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [32]:
def prep_iris():
    # clean
    iris = iris.drop_duplicates()
    iris = iris.drop(columns=['species_id','measurement_id'])
    iris = iris.rename(columns={'species_name':'species'})
    dummy_iris = pd.get_dummies(iris.species, drop_first=True)
    iris = pd.concat([iris, dummy_iris], axis=1)
    # split
    train_validate, test = train_test_split(iris, test_size=.2, random_state=42, stratify=iris.species)
    train, validate = train_test_split(train_validate, 
                                        test_size=.25, 
                                        random_state=42, 
                                        stratify=train_validate.species)
    return train, validate, test

In [33]:
import prepare as prep

In [34]:
iris = acquire.get_iris_data()
train, v, t = prep.prep_iris(iris)
train.sample(5)

csv file found and loaded
data cleaned, prepped, and split

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
92,versicolor,5.8,2.6,4.0,1.2,1,0
149,virginica,5.9,3.0,5.1,1.8,0,1
53,versicolor,5.5,2.3,4.0,1.3,1,0
109,virginica,7.2,3.6,6.1,2.5,0,1
66,versicolor,5.6,3.0,4.5,1.5,1,0

Using the Titanic Data:

- Use the function defined in `acquire.py` to load the Titanic data.

In [35]:
titanic = acquire.get_titanic_data()
titanic.sample(5)

csv file found and loaded

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
735,735,0,3,male,28.5,0,0,16.1000,S,Third,NaN,Southampton,1
754,754,1,2,female,48.0,1,2,65.0000,S,Second,NaN,Southampton,0
609,609,1,1,female,40.0,0,0,153.4625,S,First,C,Southampton,1
237,237,1,2,female,8.0,0,2,26.2500,S,Second,NaN,Southampton,0
534,534,0,3,female,30.0,0,0,8.6625,S,Third,NaN,Southampton,1

- Drop any unnecessary, unhelpful, or duplicated columns.

In [36]:
titanic = titanic.drop(columns=['age','class','deck','embark_town'])
titanic.sample(5)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone
467,467,0,1,male,0,0,26.5500,S,1
551,551,0,2,male,0,0,26.0000,S,1
263,263,0,1,male,0,0,0.0000,S,1
182,182,0,3,male,4,2,31.3875,S,0
70,70,0,2,male,0,0,10.5000,S,1

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [37]:
dummy_titanic = pd.get_dummies(titanic[['sex','embarked']], drop_first=True)
dummy_titanic.drop_duplicates()

    sex_male  embarked_Q  embarked_S
0          1           0           1
1          0           0           0
2          0           0           1
5          1           1           0
22         0           1           0
26         1           0           0

In [38]:
titanic = pd.concat([titanic, dummy_titanic], axis=1)
titanic.sample(5)

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
830,830,1,3,female,1,0,14.4542,C,0,0,0,0
231,231,0,3,male,0,0,7.7750,S,1,1,0,1
212,212,0,3,male,0,0,7.2500,S,1,1,0,1
310,310,1,1,female,0,0,83.1583,C,1,0,0,0
343,343,0,2,male,0,0,13.0000,S,1,1,0,1

- Create a function named `prep_titanic` that accepts the raw titanic data, and returns the data with the transformations above applied.

In [39]:
def prep_titanic():
    # clean
    titanic = titanic.drop_duplicates()
    titanic = titanic.drop(columns=['age','class','deck','embark_town'])
    titanic['embarked'] = titanic.embarked.fillna(value='S')
    dummy_titanic = pd.get_dummies(titanic[['sex','embarked']], drop_first=True)
    titanic = pd.concat([titanic, dummy_titanic], axis=1)
    # split
    train_validate, test = train_test_split(titanic, test_size=.2, random_state=42, stratify=titanic.survived)
    train, validate = train_test_split(train_validate, 
                                        test_size=.25, 
                                        random_state=42, 
                                        stratify=train_validate.survived)
    return train, validate, test

In [40]:
titanic = acquire.get_titanic_data()
train, v, t = prep.prep_titanic(titanic)
train.sample(5)

csv file found and loaded
data cleaned, prepped, and split

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
301,301,1,3,male,2,0,23.25,Q,0,1,1,0
486,486,1,1,female,1,0,90.00,S,0,0,0,1
740,740,1,1,male,0,0,30.00,S,1,1,0,1
546,546,1,2,female,1,0,26.00,S,0,0,0,1
673,673,1,2,male,0,0,13.00,S,1,1,0,1

Using the Telco Data:

- Use the function defined in `acquire.py` to load the Telco data.

In [41]:
telco = acquire.get_telco_data()
telco.sample(5)

csv file found and loaded

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
3577,3,1,3,5067-WJEUN,Male,0,Yes,Yes,67,Yes,...,No,No,No,Yes,54.20,3838.2,No,Two year,DSL,Bank transfer (automatic)
6012,3,2,1,8495-LJDFO,Female,1,No,No,64,Yes,...,Yes,Yes,Yes,Yes,108.95,7111.3,No,Month-to-month,Fiber optic,Bank transfer (automatic)
5862,3,3,2,8241-JUIQO,Female,0,No,No,61,Yes,...,No internet service,No internet service,No internet service,No,19.45,1336.35,No,One year,None,Bank transfer (automatic)
234,1,2,1,0362-ZBZWJ,Male,0,No,No,36,Yes,...,No,No,Yes,Yes,84.90,3067.2,Yes,Month-to-month,Fiber optic,Electronic check
6211,4,3,1,8780-RSYYU,Female,0,No,No,25,Yes,...,No internet service,No internet service,No internet service,Yes,19.20,532.1,No,Month-to-month,None,Credit card (automatic)

- Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

In [42]:
telco.sample()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
6301,1,2,1,8914-RBTSB,Male,0,Yes,No,31,Yes,...,No,Yes,No,No,93.8,3019.5,Yes,Month-to-month,Fiber optic,Electronic check

In [43]:
telco = telco.drop(columns=['customer_id','payment_type_id','internet_service_type_id','contract_type_id'])
telco.shape

(7043, 20)

In [44]:
telco.columns

Index(['gender', 'senior_citizen', 'partner', 'dependents', 'tenure',
       'phone_service', 'multiple_lines', 'online_security', 'online_backup',
       'device_protection', 'tech_support', 'streaming_tv', 'streaming_movies',
       'paperless_billing', 'monthly_charges', 'total_charges', 'churn',
       'contract_type', 'internet_service_type', 'payment_type'],
      dtype='object')

In [45]:
telco.total_charges[telco.total_charges==' ']=0
telco.total_charges = telco.total_charges.astype(float)
telco.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 20 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 7043 non-null   object
 1   senior_citizen         7043 non-null   int64
 2   partner                7043 non-null   object
 3   dependents             7043 non-null   object
 4   tenure                 7043 non-null   int64
 5   phone_service          7043 non-null   object
 6   multiple_lines         7043 non-null   object
 7   online_security        7043 non-null   object
 8   online_backup          7043 non-null   object
 9   device_protection      7043 non-null   object
 10  tech_support           7043 non-null   object
 11  streaming_tv           7043 non-null   object
 12  streaming_movies       7043 non-null   object
 13  paperless_billing      7043 non-null   object
 14  monthly_charges        7043 non-null   float64
 15  total_charges          7043 non-null   float64
 16  churn                  7043 non-null   object
 17  contract_type          7043 non-null   object
 18  internet_service_type  7043 non-null   object
 19  payment_type           7043 non-null   object
dtypes: float64(2), int64(2), object(16)
memory usage: 1.1+ MB

/var/folders/ml/8_q6055n29vf0c36kmj6w1900000gn/T/ipykernel_41078/631193109.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  telco.total_charges[telco.total_charges==' ']=0

In [46]:
telco_obj = telco.select_dtypes(include='object').columns.to_list()

In [47]:
for i in telco_obj:
    print(telco[i].unique())

['Female' 'Male']
['Yes' 'No']
['Yes' 'No']
['Yes' 'No']
['No' 'Yes' 'No phone service']
['No' 'Yes' 'No internet service']
['Yes' 'No' 'No internet service']
['No' 'Yes' 'No internet service']
['Yes' 'No' 'No internet service']
['Yes' 'No' 'No internet service']
['No' 'Yes' 'No internet service']
['Yes' 'No']
['No' 'Yes']
['One year' 'Month-to-month' 'Two year']
['DSL' 'Fiber optic' 'None']
['Mailed check' 'Electronic check' 'Credit card (automatic)'
 'Bank transfer (automatic)']

In [48]:
telco.isnull().sum()

gender                   0
senior_citizen           0
partner                  0
dependents               0
tenure                   0
phone_service            0
multiple_lines           0
online_security          0
online_backup            0
device_protection        0
tech_support             0
streaming_tv             0
streaming_movies         0
paperless_billing        0
monthly_charges          0
total_charges            0
churn                    0
contract_type            0
internet_service_type    0
payment_type             0
dtype: int64

- Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [49]:
dummy_telco = pd.get_dummies(telco[telco_obj], drop_first=True)
dummy_telco.sample(5)

,gender_Male,partner_Yes,dependents_Yes,phone_service_Yes,multiple_lines_No phone service,multiple_lines_Yes,online_security_No internet service,online_security_Yes,online_backup_No internet service,online_backup_Yes,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
6268,0,1,0,1,0,1,0,0,0,1,...,0,0,0,0,1,1,0,1,0,0
2588,1,0,0,1,0,1,0,0,0,0,...,0,1,0,0,0,1,0,0,0,0
705,0,0,0,1,0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,0
4217,1,0,0,1,0,0,0,0,0,1,...,0,1,0,0,0,0,0,1,0,0
5653,0,0,0,1,0,1,0,0,0,0,...,1,1,1,0,0,1,0,0,1,0

In [50]:
telco = pd.concat([telco, dummy_telco], axis=1)
telco.sample(5)

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
2949,Female,1,No,No,1,Yes,No,Yes,No,Yes,...,0,1,1,0,0,0,0,0,1,0
2917,Female,0,No,No,63,Yes,Yes,No,Yes,No,...,1,0,0,0,1,1,0,0,0,0
4290,Female,0,No,No,15,Yes,No,No internet service,No internet service,No internet service,...,0,0,0,0,0,0,1,0,0,1
2524,Male,0,Yes,Yes,64,Yes,Yes,No,Yes,Yes,...,1,1,0,0,1,1,0,1,0,0
5446,Female,0,Yes,Yes,36,No,No phone service,Yes,No,Yes,...,0,0,0,0,1,0,0,1,0,0

- Create a function named `prep_telco` that accepts the raw telco data, and returns the data with the transformations above applied.

In [51]:
def prep_telco(telco):
    # clean
    telco = telco.drop_duplicates()
    telco = telco.drop(columns=['customer_id','payment_type_id','internet_service_type_id','contract_type_id'])
    telco.total_charges[telco.total_charges==' ']=0
    telco.total_charges = telco.total_charges.astype(float)
    telco_obj = telco.select_dtypes(include='object').columns.to_list()
    dummy_telco = pd.get_dummies(telco[telco_obj], drop_first=True)
    telco = pd.concat([telco, dummy_telco], axis=1)
    # split
    train_validate, test = train_test_split(telco, test_size=.2, random_state=42, stratify=telco.churn)
    train, validate = train_test_split(train_validate, 
                                        test_size=.25, 
                                        random_state=42, 
                                        stratify=train_validate.churn)
    return train, validate, test

Split your data:

- Write a function to split your data into train, test and validate datasets. Add this function to `prepare.py`.

In [52]:
# written into prep functions

- Run the function in your notebook on the Iris dataset, returning 3 datasets, `train_iris`, `validate_iris` and `test_iris`.

In [53]:
iris = acquire.get_iris_data()
train_iris, validate_iris, test_iris = prep.prep_iris(iris)
train_iris.sample(5)

csv file found and loaded
data cleaned, prepped, and split

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
44,setosa,5.1,3.8,1.9,0.4,0,0
109,virginica,7.2,3.6,6.1,2.5,0,1
12,setosa,4.8,3.0,1.4,0.1,0,0
103,virginica,6.3,2.9,5.6,1.8,0,1
48,setosa,5.3,3.7,1.5,0.2,0,0

- Run the function on the Titanic dataset, returning 3 datasets, `train_titanic`, `validate_titanic` and `test_titanic`.

In [54]:
titanic = acquire.get_titanic_data()
train_titanic, validate_titanic, test_titanic = prep.prep_titanic(titanic)
train_titanic.sample(5)

csv file found and loaded
data cleaned, prepped, and split

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embarked,alone,sex_male,embarked_Q,embarked_S
400,400,1,3,male,0,0,7.9250,S,1,1,0,1
889,889,1,1,male,0,0,30.0000,C,1,1,0,0
563,563,0,3,male,0,0,8.0500,S,1,1,0,1
359,359,1,3,female,0,0,7.8792,Q,1,0,1,0
299,299,1,1,female,0,1,247.5208,C,0,0,0,0

- Run the function on the Telco dataset, returning 3 datasets, `train_telco`, `validate_telco` and `test_telco`.

In [55]:
telco = acquire.get_telco_data()
train_telco, validate_telco, test_telco = prep.prep_telco(telco)
train_telco.sample(5)

csv file found and loaded
data cleaned, prepped, and split

/Users/Tyler/codeup-data-science/classification-exercises/prepare.py:66: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  telco.total_charges[telco.total_charges==' ']=0

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
2252,Female,1,No,No,8,Yes,No,No,No,Yes,...,1,1,1,0,0,1,0,1,0,0
6688,Male,0,No,Yes,52,Yes,No,No internet service,No internet service,No internet service,...,0,0,0,1,0,0,1,1,0,0
1923,Female,1,Yes,No,5,Yes,No,No,No,No,...,0,1,0,0,0,1,0,0,1,0
3879,Female,1,Yes,No,72,Yes,Yes,Yes,Yes,Yes,...,1,1,0,0,1,1,0,1,0,0
5159,Female,0,No,No,1,Yes,No,No,No,No,...,0,0,0,0,0,0,0,0,0,1